//제철음식 @ 한반도

import 'package:flutter/material.dart';

Map<int, List<String>> jechul = {
  //add the elements 
  //reference : https://blog.naver.com/kimwhddms/221766076576
  //only parts of the elements from the blog post has been added. 
  1: ['잣', '자몽', '한라봉', '레드향', '다금바리', '도미', '돌돔', '방어', '빙어', '산천어', '조기', '낙지'],
  2: ['피조개', '홍게', '꼬막', '홍어', '숭어', '벵에돔', '딸기', '시금치'],
  3: ['취나물', '표고버섯', '우엉', '연근', '야콘', '애호박', '양배추', '쑥', '미나리'],
  4: ['마늘', '머위', '부추', '두릅', '돌나물', '더덕', '달래', '냉이', '가지', '고사리'],
  5: ['완두콩', '매실', '능성어', '메로', '병어', '부세', '우럭', '장어', '전갱이', '참돔'],
  6: ['군소', '다슬기', '성게', '소라', '재첩', '한치', '가지', '감자', '근대', '복분자', '양파'],
  7: ['치커리', '옥수수', '오이', '여주', '양상추', '블루베리', '도라지', '근대', '청각'],
  8: ['복숭아', '오렌지', '자두', '참외', '수박', '메론', '포도', '갈치', '농어', '민어', '전복'],
  9: ['당근', '대파', '방아잎', '생강', '야콘', '은행', '토마토', '아보카도', '표고버섯'],
  10: ['쪽파', '연근', '시레기', '송이버섯', '생강', '밤', '마', '대파', '당근', '늙은호박'],
  11: ['갓', '홍합', '해삼', '오징어', '새우', '문어', '매생이', '낙지', '굴', '과메기', '참조기'],
  12: ['삼치', '빙어', '명태', '돌돔', '도미', '까나리', '귤', '잣', '피조개', '브로콜리'],
};

class JechulFoodRec extends StatelessWidget{
  
}